In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

In [3]:
import os

In [9]:
path = 'data/ex1data2.txt'
data2 = pd.read_csv(path, header=None, names=['Size', 'Bedrooms', 'Price'])
data2.head()

   Size  Bedrooms   Price
0  2104         3  399900
1  1600         3  329900
2  2400         3  369000
3  1416         2  232000
4  3000         4  539900

In [11]:
data2.sample(10)

    Size  Bedrooms   Price
36  1239         3  229900
11  2000         3  347000
25  1100         3  249900
0   2104         3  399900
9   1494         3  242500
19  3031         4  599000
45  1852         4  299900
8   1380         3  212000
21  1888         2  255000
41  2238         3  329900

In [12]:
data2 = (data2 - data2.mean()) / data2.std()
data2.head()

       Size  Bedrooms     Price
0  0.130010 -0.223675  0.475747
1 -0.504190 -0.223675 -0.084074
2  0.502476 -0.223675  0.228626
3 -0.735723 -1.537767 -0.867025
4  1.257476  1.090417  1.595389

In [23]:
def compute_cost(X, y, theta):
    m = len(y)
    h = np.dot(X, theta)
    J = (1 / (2 * m)) * np.asscalar(np.dot((h-y), (h-y).T))
    return J

In [24]:
def gradient_descent(X, y, theta, alpha, num_iters):
    m = len(y)
    J_history = np.zeros((num_iters, 1))
    for iter in range(num_iters):
        h = np.dot(X, theta)
        delta = (1/m) * np.dot(X.T, (h - y))
        theta = theta - alpha * delta
        J_history[iter] = compute_cost(X, y, theta)
    return (theta, J_history)

In [15]:
data2.insert(0, 'Ones', 1)

In [16]:
data2.head()

   Ones      Size  Bedrooms     Price
0     1  0.130010 -0.223675  0.475747
1     1 -0.504190 -0.223675 -0.084074
2     1  0.502476 -0.223675  0.228626
3     1 -0.735723 -1.537767 -0.867025
4     1  1.257476  1.090417  1.595389

In [45]:
cols = data2.shape[1]
X2 = data2.iloc[:,0:cols-1]
y2 = data2.iloc[:,cols-1:cols]

In [46]:
X2 = np.matrix(X2.values)
y2 = np.matrix(y2.values)
theta2 = np.array([0,0,0]).reshape((-1, 1))

In [48]:
g2, cost2 = gradient_descent(X2, y2, theta2, 0.01, 1500)

ValueError: can only convert an array of size 1 to a Python scalar

In [47]:
theta2

array([[0],
       [0],
       [0]])